MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA310/mcu.h
#define _U4MODE_PDSEL0_POSITION                  0x00000001
#define _U4MODE_PDSEL0_MASK                      0x00000002
#define _U4MODE_PDSEL0_LENGTH                    0x00000001

#define _U4MODE_PDSEL1_POSITION                  0x00000002
#define _U4MODE_PDSEL1_MASK                      0x00000004
#define _U4MODE_PDSEL1_LENGTH                    0x00000001

#define _U4MODE_UEN0_POSITION                    0x00000008
#define _U4MODE_UEN0_MASK                        0x00000100
#define _U4MODE_UEN0_LENGTH                      0x00000001

#define _U4MODE_UEN1_POSITION                    0x00000009
#define _U4MODE_UEN1_MASK                        0x00000200
#define _U4MODE_UEN1_LENGTH                      0x00000001

#define _U4STA_URXDA_POSITION                    0x00000000
#define _U4STA_URXDA_MASK                        0x00000001
#define _U4STA_URXDA_LENGTH                      0x00000001

#define _U4STA_OERR_POSITION                     0x00000001
#define _U4STA_OERR_MASK                         0x00000002
#define _U4STA_OERR_LENGTH                       0x00000001

#define _U4STA_FERR_POSITION                     0x00000002
#define _U4STA_FERR_MASK                         0x00000004
#define _U4STA_FERR_LENGTH                       0x00000001

#define _U4STA_PERR_POSITION                     0x00000003
#define _U4STA_PERR_MASK                         0x00000008
#define _U4STA_PERR_LENGTH                       0x00000001

#define _U4STA_RIDLE_POSITION                    0x00000004
#define _U4STA_RIDLE_MASK                        0x00000010
#define _U4STA_RIDLE_LENGTH                      0x00000001

#define _U4STA_ADDEN_POSITION                    0x00000005
#define _U4STA_ADDEN_MASK                        0x00000020
#define _U4STA_ADDEN_LENGTH                      0x00000001

#define _U4STA_URXISEL_POSITION                  0x00000006
#define _U4STA_URXISEL_MASK                      0x000000C0
#define _U4STA_URXISEL_LENGTH                    0x00000002

#define _U4STA_TRMT_POSITION                     0x00000008
#define _U4STA_TRMT_MASK                         0x00000100
#define _U4STA_TRMT_LENGTH                       0x00000001

#define _U4STA_UTXBF_POSITION                    0x00000009
#define _U4STA_UTXBF_MASK                        0x00000200
#define _U4STA_UTXBF_LENGTH                      0x00000001

#define _U4STA_UTXEN_POSITION                    0x0000000A
#define _U4STA_UTXEN_MASK                        0x00000400
#define _U4STA_UTXEN_LENGTH                      0x00000001

#define _U4STA_UTXBRK_POSITION                   0x0000000B
#define _U4STA_UTXBRK_MASK                       0x00000800
#define _U4STA_UTXBRK_LENGTH                     0x00000001

#define _U4STA_UTXISEL0_POSITION                 0x0000000D
#define _U4STA_UTXISEL0_MASK                     0x00002000
#define _U4STA_UTXISEL0_LENGTH                   0x00000001

#define _U4STA_UTXINV_POSITION                   0x0000000E
#define _U4STA_UTXINV_MASK                       0x00004000
#define _U4STA_UTXINV_LENGTH                     0x00000001

#define _U4STA_UTXISEL1_POSITION                 0x0000000F
#define _U4STA_UTXISEL1_MASK                     0x00008000
#define _U4STA_UTXISEL1_LENGTH                   0x00000001

#define _U4STA_URXISEL0_POSITION                 0x00000006
#define _U4STA_URXISEL0_MASK                     0x00000040
#define _U4STA_URXISEL0_LENGTH                   0x00000001

#define _U4STA_URXISEL1_POSITION                 0x00000007
#define _U4STA_URXISEL1_MASK                     0x00000080
#define _U4STA_URXISEL1_LENGTH                   0x00000001

#define _U4TXREG_UTXREG0_POSITION                0x00000000
#define _U4TXREG_UTXREG0_MASK                    0x00000001
#define _U4TXREG_UTXREG0_LENGTH                  0x00000001

#define _U4TXREG_UTXREG1_POSITION                0x00000001
#define _U4TXREG_UTXREG1_MASK                    0x00000002
#define _U4TXREG_UTXREG1_LENGTH                  0x00000001

#define _U4TXREG_UTXREG2_POSITION                0x00000002
#define _U4TXREG_UTXREG2_MASK                    0x00000004
#define _U4TXREG_UTXREG2_LENGTH                  0x00000001

#define _U4TXREG_UTXREG3_POSITION                0x00000003
#define _U4TXREG_UTXREG3_MASK                    0x00000008
#define _U4TXREG_UTXREG3_LENGTH                  0x00000001

#define _U4TXREG_UTXREG4_POSITION                0x00000004
#define _U4TXREG_UTXREG4_MASK                    0x00000010
#define _U4TXREG_UTXREG4_LENGTH                  0x00000001

#define _U4TXREG_UTXREG5_POSITION                0x00000005
#define _U4TXREG_UTXREG5_MASK                    0x00000020
#define _U4TXREG_UTXREG5_LENGTH                  0x00000001

#define _U4TXREG_UTXREG6_POSITION                0x00000006
#define _U4TXREG_UTXREG6_MASK                    0x00000040
#define _U4TXREG_UTXREG6_LENGTH                  0x00000001

#define _U4TXREG_UTXREG7_POSITION                0x00000007
#define _U4TXREG_UTXREG7_MASK                    0x00000080
#define _U4TXREG_UTXREG7_LENGTH                  0x00000001

#define _U4TXREG_UTXREG8_POSITION                0x00000008
#define _U4TXREG_UTXREG8_MASK                    0x00000100
#define _U4TXREG_UTXREG8_LENGTH                  0x00000001

#define _U4RXREG_URXREG0_POSITION                0x00000000
#define _U4RXREG_URXREG0_MASK                    0x00000001
#define _U4RXREG_URXREG0_LENGTH                  0x00000001

#define _U4RXREG_URXREG1_POSITION                0x00000001
#define _U4RXREG_URXREG1_MASK                    0x00000002
#define _U4RXREG_URXREG1_LENGTH                  0x00000001

#define _U4RXREG_URXREG2_POSITION                0x00000002
#define _U4RXREG_URXREG2_MASK                    0x00000004
#define _U4RXREG_URXREG2_LENGTH                  0x00000001

#define _U4RXREG_URXREG3_POSITION                0x00000003
#define _U4RXREG_URXREG3_MASK                    0x00000008
#define _U4RXREG_URXREG3_LENGTH                  0x00000001

#define _U4RXREG_URXREG4_POSITION                0x00000004
#define _U4RXREG_URXREG4_MASK                    0x00000010
#define _U4RXREG_URXREG4_LENGTH                  0x00000001

#define _U4RXREG_URXREG5_POSITION                0x00000005
#define _U4RXREG_URXREG5_MASK                    0x00000020
#define _U4RXREG_URXREG5_LENGTH                  0x00000001

#define _U4RXREG_URXREG6_POSITION                0x00000006
#define _U4RXREG_URXREG6_MASK                    0x00000040
#define _U4RXREG_URXREG6_LENGTH                  0x00000001

#define _U4RXREG_URXREG7_POSITION                0x00000007
#define _U4RXREG_URXREG7_MASK                    0x00000080
#define _U4RXREG_URXREG7_LENGTH                  0x00000001

#define _U4RXREG_URXREG8_POSITION                0x00000008
#define _U4RXREG_URXREG8_MASK                    0x00000100
#define _U4RXREG_URXREG8_LENGTH                  0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

