MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA310/mcu.h
#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

#define _ANSG_ANSELG9_POSITION                   0x00000009
#define _ANSG_ANSELG9_MASK                       0x00000200
#define _ANSG_ANSELG9_LENGTH                     0x00000001

#define _LCDREG_CKSEL_POSITION                   0x00000000
#define _LCDREG_CKSEL_MASK                       0x00000003
#define _LCDREG_CKSEL_LENGTH                     0x00000002

#define _LCDREG_MODE13_POSITION                  0x00000002
#define _LCDREG_MODE13_MASK                      0x00000004
#define _LCDREG_MODE13_LENGTH                    0x00000001

#define _LCDREG_BIAS_POSITION                    0x00000003
#define _LCDREG_BIAS_MASK                        0x00000038
#define _LCDREG_BIAS_LENGTH                      0x00000003

#define _LCDREG_CPEN_POSITION                    0x0000000F
#define _LCDREG_CPEN_MASK                        0x00008000
#define _LCDREG_CPEN_LENGTH                      0x00000001

#define _LCDREG_CKSEL0_POSITION                  0x00000000
#define _LCDREG_CKSEL0_MASK                      0x00000001
#define _LCDREG_CKSEL0_LENGTH                    0x00000001

#define _LCDREG_CKSEL1_POSITION                  0x00000001
#define _LCDREG_CKSEL1_MASK                      0x00000002
#define _LCDREG_CKSEL1_LENGTH                    0x00000001

#define _LCDREG_BIAS0_POSITION                   0x00000003
#define _LCDREG_BIAS0_MASK                       0x00000008
#define _LCDREG_BIAS0_LENGTH                     0x00000001

#define _LCDREG_BIAS1_POSITION                   0x00000004
#define _LCDREG_BIAS1_MASK                       0x00000010
#define _LCDREG_BIAS1_LENGTH                     0x00000001

#define _LCDREG_BIAS2_POSITION                   0x00000005
#define _LCDREG_BIAS2_MASK                       0x00000020
#define _LCDREG_BIAS2_LENGTH                     0x00000001

#define _LCDREF_LRLAT_POSITION                   0x00000000
#define _LCDREF_LRLAT_MASK                       0x00000007
#define _LCDREF_LRLAT_LENGTH                     0x00000003

#define _LCDREF_LRLBP_POSITION                   0x00000004
#define _LCDREF_LRLBP_MASK                       0x00000030
#define _LCDREF_LRLBP_LENGTH                     0x00000002

#define _LCDREF_LRLAP_POSITION                   0x00000006
#define _LCDREF_LRLAP_MASK                       0x000000C0
#define _LCDREF_LRLAP_LENGTH                     0x00000002

#define _LCDREF_VLCD1PE_POSITION                 0x00000008
#define _LCDREF_VLCD1PE_MASK                     0x00000100
#define _LCDREF_VLCD1PE_LENGTH                   0x00000001

#define _LCDREF_VLCD2PE_POSITION                 0x00000009
#define _LCDREF_VLCD2PE_MASK                     0x00000200
#define _LCDREF_VLCD2PE_LENGTH                   0x00000001

#define _LCDREF_VLCD3PE_POSITION                 0x0000000A
#define _LCDREF_VLCD3PE_MASK                     0x00000400
#define _LCDREF_VLCD3PE_LENGTH                   0x00000001

#define _LCDREF_LCDCST_POSITION                  0x0000000B
#define _LCDREF_LCDCST_MASK                      0x00003800
#define _LCDREF_LCDCST_LENGTH                    0x00000003

#define _LCDREF_LCDIRE_POSITION                  0x0000000F
#define _LCDREF_LCDIRE_MASK                      0x00008000
#define _LCDREF_LCDIRE_LENGTH                    0x00000001

#define _LCDREF_LRLAT0_POSITION                  0x00000000
#define _LCDREF_LRLAT0_MASK                      0x00000001
#define _LCDREF_LRLAT0_LENGTH                    0x00000001

#define _LCDREF_LRLAT1_POSITION                  0x00000001
#define _LCDREF_LRLAT1_MASK                      0x00000002
#define _LCDREF_LRLAT1_LENGTH                    0x00000001

#define _LCDREF_LRLAT2_POSITION                  0x00000002
#define _LCDREF_LRLAT2_MASK                      0x00000004
#define _LCDREF_LRLAT2_LENGTH                    0x00000001

#define _LCDREF_LRLBP0_POSITION                  0x00000004
#define _LCDREF_LRLBP0_MASK                      0x00000010
#define _LCDREF_LRLBP0_LENGTH                    0x00000001

#define _LCDREF_LRLBP1_POSITION                  0x00000005
#define _LCDREF_LRLBP1_MASK                      0x00000020
#define _LCDREF_LRLBP1_LENGTH                    0x00000001

#define _LCDREF_LRLAP0_POSITION                  0x00000006
#define _LCDREF_LRLAP0_MASK                      0x00000040
#define _LCDREF_LRLAP0_LENGTH                    0x00000001

#define _LCDREF_LRLAP1_POSITION                  0x00000007
#define _LCDREF_LRLAP1_MASK                      0x00000080
#define _LCDREF_LRLAP1_LENGTH                    0x00000001

#define _LCDREF_LCDCST0_POSITION                 0x0000000B
#define _LCDREF_LCDCST0_MASK                     0x00000800
#define _LCDREF_LCDCST0_LENGTH                   0x00000001

#define _LCDREF_LCDCST1_POSITION                 0x0000000C
#define _LCDREF_LCDCST1_MASK                     0x00001000
#define _LCDREF_LCDCST1_LENGTH                   0x00000001

#define _LCDREF_LCDCST2_POSITION                 0x0000000D
#define _LCDREF_LCDCST2_MASK                     0x00002000
#define _LCDREF_LCDCST2_LENGTH                   0x00000001

#define _LCDCON_LMUX_POSITION                    0x00000000
#define _LCDCON_LMUX_MASK                        0x00000007
#define _LCDCON_LMUX_LENGTH                      0x00000003

#define _LCDCON_CS_POSITION                      0x00000003
#define _LCDCON_CS_MASK                          0x00000018
#define _LCDCON_CS_LENGTH                        0x00000002

#define _LCDCON_WERR_POSITION                    0x00000005
#define _LCDCON_WERR_MASK                        0x00000020
#define _LCDCON_WERR_LENGTH                      0x00000001

