MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA310/mcu.h
#define WPFP_WPFP0           0xFFC0
#define WPFP_WPFP1           0xFFC1
#define WPFP_WPFP2           0xFFC2
#define WPFP_WPFP3           0xFFC3
#define WPFP_WPFP4           0xFFC4
#define WPFP_WPFP5           0xFFC5
#define WPFP_WPFP6           0xFFC6
#define WPFP_WPFP7           0xFFC7
#define WPFP_WPFP8           0xFFC8
#define WPFP_WPFP9           0xFFC9
#define WPFP_WPFP10          0xFFCA
#define WPFP_WPFP11          0xFFCB
#define WPFP_WPFP12          0xFFCC
#define WPFP_WPFP13          0xFFCD
#define WPFP_WPFP14          0xFFCE
#define WPFP_WPFP15          0xFFCF
#define WPFP_WPFP16          0xFFD0
#define WPFP_WPFP17          0xFFD1
#define WPFP_WPFP18          0xFFD2
#define WPFP_WPFP19          0xFFD3
#define WPFP_WPFP20          0xFFD4
#define WPFP_WPFP21          0xFFD5
#define WPFP_WPFP22          0xFFD6
#define WPFP_WPFP23          0xFFD7
#define WPFP_WPFP24          0xFFD8
#define WPFP_WPFP25          0xFFD9
#define WPFP_WPFP26          0xFFDA
#define WPFP_WPFP27          0xFFDB
#define WPFP_WPFP28          0xFFDC
#define WPFP_WPFP29          0xFFDD
#define WPFP_WPFP30          0xFFDE
#define WPFP_WPFP31          0xFFDF
#define WPFP_WPFP32          0xFFE0
#define WPFP_WPFP33          0xFFE1
#define WPFP_WPFP34          0xFFE2
#define WPFP_WPFP35          0xFFE3
#define WPFP_WPFP36          0xFFE4
#define WPFP_WPFP37          0xFFE5
#define WPFP_WPFP38          0xFFE6
#define WPFP_WPFP39          0xFFE7
#define WPFP_WPFP40          0xFFE8
#define WPFP_WPFP41          0xFFE9
#define WPFP_WPFP42          0xFFEA
#define WPFP_WPFP43          0xFFEB
#define WPFP_WPFP44          0xFFEC
#define WPFP_WPFP45          0xFFED
#define WPFP_WPFP46          0xFFEE
#define WPFP_WPFP47          0xFFEF
#define WPFP_WPFP48          0xFFF0
#define WPFP_WPFP49          0xFFF1
#define WPFP_WPFP50          0xFFF2
#define WPFP_WPFP51          0xFFF3
#define WPFP_WPFP52          0xFFF4
#define WPFP_WPFP53          0xFFF5
#define WPFP_WPFP54          0xFFF6
#define WPFP_WPFP55          0xFFF7
#define WPFP_WPFP56          0xFFF8
#define WPFP_WPFP57          0xFFF9
#define WPFP_WPFP58          0xFFFA
#define WPFP_WPFP59          0xFFFB
#define WPFP_WPFP60          0xFFFC
#define WPFP_WPFP61          0xFFFD
#define WPFP_WPFP62          0xFFFE
#define WPFP_WPFP63          0xFFFF

#define VBTBOR_OFF           0xFF7F
#define VBTBOR_ON            0xFFFF

#define SOSCSEL_OFF          0xFEFF
#define SOSCSEL_ON           0xFFFF

#define WDTWIN_PS75_0        0xF3FF
#define WDTWIN_PS50_0        0xF7FF
#define WDTWIN_PS37_5        0xFBFF
#define WDTWIN_PS25_0        0xFFFF

#define BOREN_OFF            0xEFFF
#define BOREN_ON             0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

/* Register CONFIG2 (0xabfc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _CONFIG2;
#define _CONFIG2(x) __attribute__((address(0xabfc),deprecated_definition("consider migrating to #pragma config"),section("__CONFIG2.sec"),space(prog))) __prog__ uint16_t _CONFIG2 = (x);

/*
** Only one invocation of CONFIG2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG2.
** Multiple options may be combined, as shown:
**
** _CONFIG2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMD_EC            External-Clock Mode Enabled
**     POSCMD_XT            XT Oscillator Enabled
**     POSCMD_HS            HS Oscillator Enabled
**     POSCMD_NONE          Primary Oscillator Disabled
**
**   BOR Override bit:
**     BOREN1_DIS           BOR Disabled [When BOREN=0]
**     BOREN1_EN            BOR Enabled [When BOREN=1]
**
**   IOLOCK One-Way Set Enable bit:
**     IOL1WAY_OFF          The IOLOCK bit can be set and cleared using the unlock sequence
**     IOL1WAY_ON           Once set, the IOLOCK bit cannot be cleared
**
**   OSCO Pin Configuration:
**     OSCIOFCN_ON          OSCO/CLKO/RC15 functions as port I/O (RC15)
**     OSCIOFCN_OFF         OSCO/CLKO/RC15 functions as CLKO (FOSC/2)
**
**   Clock Switching and Fail-Safe Clock Monitor Configuration bits:
**     FCKSM_CSECME         Clock switching is enabled, Fail-Safe Clock Monitor is enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-Safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Clock switching and Fail-Safe Clock Monitor are disabled
**
**   Initial Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XTPLL,HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC Oscillator with Postscaler (FRCDIV)
**
**   Alternate VREF/CVREF Pins Selection bit:
**     ALTVREF_ALT_AV_ALT_CVVoltage reference input, ADC =RB0/RB1   Comparator =RB0/RB1
**     ALTVREF_ALT_AV_DLT_CVVoltage reference input, ADC =RB0/RB1   Comparator =RA9,RA10
**     ALTVREF_DLT_AV_ALT_CVVoltage reference input, ADC =RA9/RA10 Comparator =RB0,RB1
**     ALTVREF_DLT_AV_DLT_CVVoltage reference input, ADC =RA9/RA10 Comparator =RA9,RA10
**
**   Internal External Switchover:
**     IESO_OFF             Disabled
**     IESO_ON              Enabled
**
*/

#define POSCMD_EC            0xFFFC
#define POSCMD_XT            0xFFFD
#define POSCMD_HS            0xFFFE
#define POSCMD_NONE          0xFFFF

#define BOREN1_DIS           0xFFF7
#define BOREN1_EN            0xFFFF

#define IOL1WAY_OFF          0xFFEF
#define IOL1WAY_ON           0xFFFF

#define OSCIOFCN_ON          0xFFDF
#define OSCIOFCN_OFF         0xFFFF

#define FCKSM_CSECME         0xFF3F
#define FCKSM_CSECMD         0xFF7F
#define FCKSM_CSDCMD         0xFFBF

#define FNOSC_FRC            0xF8FF
#define FNOSC_FRCPLL         0xF9FF
#define FNOSC_PRI            0xFAFF
#define FNOSC_PRIPLL         0xFBFF
#define FNOSC_SOSC           0xFCFF
#define FNOSC_LPRC           0xFDFF
#define FNOSC_FRCDIV         0xFFFF

#define ALTVREF_ALT_AV_ALT_CV 0xE7FF
#define ALTVREF_ALT_AV_DLT_CV 0xEFFF
#define ALTVREF_DLT_AV_ALT_CV 0xF7FF
#define ALTVREF_DLT_AV_DLT_CV 0xFFFF

#define IESO_OFF             0x7FFF
#define IESO_ON              0xFFFF

/* Register CONFIG1 (0xabfe)                               */

